In [4]:
import pandas as pd
import numpy as np

In [3]:
d = {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
pd.Series(d)

a    100
b    200
c    300
d    400
e    800
dtype: int64

In [5]:
pd.Series(np.array([10, 20, 30, 40, 50]))

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [7]:
series = pd.Series((100, 200, 'python', 300.12, 400))
series

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [16]:
series[5] = 'php'
series

0       100
1       200
2    python
3    300.12
4       400
5       php
dtype: object

In [17]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority':  ['yes',  'yes',  'no',  'yes',  'no',  'no',  'no',  'yes',  'no', 'no']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [22]:
dframe = pd.DataFrame(data, index=labels)

In [23]:
dframe

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [25]:
dframe[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [31]:
dframe.iloc[[3,4,8]]

  animal  age  visits priority
d    dog  NaN       3      yes
e    dog  5.0       2       no
i    dog  7.0       2       no

In [32]:
dframe[dframe['visits'] >= 3]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

In [35]:
dframe[(dframe['animal'] == 'cat') & (dframe['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [36]:
dframe[(dframe['age'] >= 2) & (dframe['age'] <= 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [37]:
dframe['visits'].sum()

19

In [44]:
new_dframe = dframe.append(pd.Series({'animal': 'rat', 'age': 0.5, 'visits': 5, 'priority': 'yes'}, name='k'))
new_dframe

D:\Users\Ihor\AppData\Local\Temp\ipykernel_16276\3795595012.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_dframe = dframe.append(pd.Series({'animal': 'rat', 'age': 0.5, 'visits': 5, 'priority': 'yes'}, name='k'))

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
k    rat  0.5       5      yes

In [45]:
new_dframe.drop('k')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no